STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
/**
  ******************************************************************************
  * @file    stm32u5x9j_discovery_lcd.c
  * @author  MCD Application Team
  * @brief   This file includes the driver for Liquid Crystal Display (LCD) module
  *          mounted on MB1829A board (ARGB8888 color format).
  @verbatim
  1. How To use this driver:
  --------------------------
     - This driver is used to drive directly in command mode a LCD TFT using the
       DSI interface.
       The following IPs are implied : DSI Host IP block working
       in conjunction to the LTDC controller.
     - This driver is linked by construction to LCD.

  2. Driver description:
  ----------------------
    + Initialization steps:
       o Initialize the LCD using the BSP_LCD_Init() function. You can select
         display orientation with "Orientation" parameter (portrait, landscape,
         portrait with 180 degrees rotation or landscape with 180 degrees
         rotation).
       o Call BSP_LCD_GetXSize() and BSP_LCD_GetYsize() to get respectively
         width and height in pixels of LCD in the current orientation.
       o Call BSP_LCD_SetBrightness() and BSP_LCD_GetBrightness() to
         respectively set and get LCD brightness.
       o Call BSP_LCD_SetActiveLayer() to select the current active layer.
       o Call BSP_LCD_GetFormat() to get LCD pixel format supported.

    + Display on LCD:
       o Call BSP_LCD_DisplayOn() and BSP_LCD_DisplayOff() to respectively
         switch on and switch off the LCD display.
       o First, check that frame buffer is available using BSP_LCD_IsFrameBufferAvailable().
       o When frame buffer is available, modify it using following functions:
         o Call BSP_LCD_WritePixel() and BSP_LCD_ReadPixel() to respectively write
           and read a pixel.
         o Call BSP_LCD_DrawHLine() to draw a horizontal line.
         o Call BSP_LCD_DrawVLine() to draw a vertical line.
         o Call BSP_LCD_DrawBitmap() to draw a bitmap.
         o Call BSP_LCD_FillRect() to draw a rectangle.
         o Call BSP_LCD_FillRGBRect() to draw a rectangle with RGB buffer.
       o Call BSP_LCD_Refresh() to refresh LCD display.

    + De-initialization steps:
       o De-initialize the LCD using the BSP_LCD_DeInit() function.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5x9j_discovery_lcd.h"
#include "stm32u5x9j_discovery_gfxmmu_lut.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U5x9J_DISCOVERY
  * @{
  */

/** @defgroup STM32U5x9J_DISCOVERY_LCD LCD
  * @{
  */

/** @defgroup STM32U5x9J_DISCOVERY_LCD_Private_Defines LCD Private Constants
  * @{
  */

/**
  * @}
  */

/** @defgroup STM32U5x9J_DISCOVERY_LCD_Private_Variables LCD Private Variables
  * @{
  */
/* Physical frame buffer for background and foreground layers */
/* 480*480 pixels with 32bpp - 20% */
#if defined ( __ICCARM__ )  /* IAR Compiler */
#pragma data_alignment = 16
static uint32_t              PhysFrameBuffer[184320];
#elif defined (__GNUC__)    /* GNU Compiler */
static uint32_t              PhysFrameBuffer[184320] __attribute__((aligned(16)));
#else                       /* ARM Compiler */
__align(16) static uint32_t  PhysFrameBuffer[164072];
#endif /* IAR Compiler */

#if (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 1)
static uint32_t LcdGfxmmu_IsMspCbValid[LCD_INSTANCES_NBR] = {0};
#endif /* (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 1) */

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
static uint32_t LcdLtdc_IsMspCbValid[LCD_INSTANCES_NBR] = {0};
#endif /* (USE_HAL_LTDC_REGISTER_CALLBACKS == 1) */

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
static uint32_t LcdDsi_IsMspCbValid[LCD_INSTANCES_NBR] = {0};
#endif /* (USE_HAL_DSI_REGISTER_CALLBACKS == 1) */

#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
static uint32_t LcdDma2d_IsMspCbValid[LCD_INSTANCES_NBR] = {0};
#endif /* (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1) */

GFXMMU_HandleTypeDef      hlcd_gfxmmu = {0};
LTDC_HandleTypeDef        hlcd_ltdc   = {0};
DSI_HandleTypeDef         hlcd_dsi    = {0};
DMA2D_HandleTypeDef       hlcd_dma2d  = {0};
static DSI_VidCfgTypeDef  VidCfg      = {0};
/**
  * @}
  */

/** @defgroup STM32U5x9J_DISCOVERY_LCD_Private_FunctionPrototypes LCD Private Function Prototypes
  * @{
  */
static int32_t LCD_Init(uint32_t Orientation);
static int32_t LCD_DeInit(void);

static int32_t LCD_ConvertLineToARGB8888(uint32_t *pSrc, uint32_t *pDst, uint32_t xSize, uint32_t ColorMode);

static void    GFXMMU_MspInit(GFXMMU_HandleTypeDef *hgfxmmu);
static void    GFXMMU_MspDeInit(GFXMMU_HandleTypeDef *hgfxmmu);
static void    LTDC_MspInit(LTDC_HandleTypeDef *hltdc);
static void    LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc);
static void    DSI_MspInit(DSI_HandleTypeDef *hdsi);
static void    DSI_MspDeInit(DSI_HandleTypeDef *hdsi);
#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
static void    DSI_EndOfRefreshCallback(DSI_HandleTypeDef *hdsi);
#endif /* (USE_HAL_DSI_REGISTER_CALLBACKS == 1) */
static void    DMA2D_MspInit(DMA2D_HandleTypeDef *hdma2d);
static void    DMA2D_MspDeInit(DMA2D_HandleTypeDef *hdma2d);
/**
  * @}
  */

/** @addtogroup STM32U5x9J_DISCOVERY_LCD_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the LCD.
  * @param  Instance LCD Instance.
  * @param  Orientation LCD_ORIENTATION_PORTRAIT, LCD_ORIENTATION_LANDSCAPE,
  *                     LCD_ORIENTATION_PORTRAIT_ROT180 or LCD_ORIENTATION_LANDSCAPE_ROT180.
  * @retval BSP status.
  */
int32_t BSP_LCD_Init(uint32_t Instance, uint32_t Orientation)
{
  int32_t status = BSP_ERROR_NONE;

  if ((Instance >= LCD_INSTANCES_NBR) || (Orientation > LCD_ORIENTATION_LANDSCAPE_ROT180))
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else if ((Orientation == LCD_ORIENTATION_LANDSCAPE) || (Orientation == LCD_ORIENTATION_LANDSCAPE_ROT180))
  {
    status = BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }
  else
  {
    if (LCD_Init(Orientation) != 0)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }

