STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
  return status;
}

/**
  * @brief  Draw a horizontal line on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  Length Length of the line.
  * @param  Color Color of the line.
  * @retval BSP status.
  */
int32_t BSP_LCD_DrawHLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t status = BSP_ERROR_NONE;
  uint32_t  Xaddress;
  uint32_t  i;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Get the rectangle start address */
    Xaddress = (hlcd_ltdc.LayerCfg[0].FBStartAdress + (4U * ((Ypos * PIXEL_PER_LINE) + Xpos)));

    /* Draw the line on LCD */
    for (i = 0; i < Length; i++)
    {
      *(__IO uint32_t *)(Xaddress) = Color;
      Xaddress += 4U;
    }
  }

  return status;
}

/**
  * @brief  Draw a vertical line on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  Length Length of the line.
  * @param  Color Color of the line.
  * @retval BSP status.
  */
int32_t BSP_LCD_DrawVLine(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Length, uint32_t Color)
{
  int32_t status = BSP_ERROR_NONE;
  uint32_t  Xaddress;
  uint32_t  i;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Get the rectangle start address */
    Xaddress = (hlcd_ltdc.LayerCfg[0].FBStartAdress + (4U * ((Ypos * PIXEL_PER_LINE) + Xpos)));

    /* Draw the line on LCD */
    for (i = 0; i < Length; i++)
    {
      *(__IO uint32_t *)(Xaddress) = Color;
      Xaddress += 3072U;
    }
  }

  return status;
}

/**
  * @brief  Draw and fill a rectangle on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  Width Width of the rectangle.
  * @param  Height Height of the rectangle.
  * @param  Color Color of the rectangle.
  * @retval BSP status.
  */
int32_t BSP_LCD_FillRect(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Width, uint32_t Height,
                         uint32_t Color)
{
  int32_t status = BSP_ERROR_NONE;
  uint32_t  Xaddress;
  uint32_t  Startaddress;
  uint32_t  i;
  uint32_t  j;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Get the rectangle start address */
    Startaddress = (hlcd_ltdc.LayerCfg[0].FBStartAdress + (4U * ((Ypos * PIXEL_PER_LINE) + Xpos)));

    /* Fill the rectangle */
    for (i = 0; i < Height; i++)
    {
      Xaddress = Startaddress + (3072U * i);
      for (j = 0; j < Width; j++)
      {
        *(__IO uint32_t *)(Xaddress) = Color;
        Xaddress += 4U;
      }
    }
  }

  return status;
}

/**
  * @brief  Read a pixel on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  Color Pointer to the pixel.
  * @retval BSP status.
  */
int32_t BSP_LCD_ReadPixel(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t *Color)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Read pixel on LCD */
    *Color = (*(__IO uint32_t *)(hlcd_ltdc.LayerCfg[0].FBStartAdress + (4U * ((Ypos * PIXEL_PER_LINE) + Xpos))));
  }

  return status;
}

/**
  * @brief  Write a pixel on LCD.
  * @param  Instance LCD Instance.
  * @param  Xpos X position.
  * @param  Ypos Y position.
  * @param  Color Pixel.
  * @retval BSP status.
  */
int32_t BSP_LCD_WritePixel(uint32_t Instance, uint32_t Xpos, uint32_t Ypos, uint32_t Color)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Write pixel on LCD */
    *(__IO uint32_t *)(hlcd_ltdc.LayerCfg[0].FBStartAdress + (4U * ((Ypos * PIXEL_PER_LINE) + Xpos))) = Color;
  }

  return status;
}

/**
  * @brief  Get pixel format supported by LCD.
  * @param  Instance LCD Instance.
  * @param  Format Pointer on pixel format.
  * @retval BSP status.
  */
int32_t BSP_LCD_GetFormat(uint32_t Instance, uint32_t *Format)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Get pixel format supported by LCD */
    *Format = LCD_PIXEL_FORMAT_ARGB8888;
  }

  return status;
}


/**
  * @brief  MX GFXMMU initialization.
  * @param  hgfxmmu GFXMMU handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_GFXMMU_Init(GFXMMU_HandleTypeDef *hgfxmmu)
{
  /* Initialize GFXMMU */
  hgfxmmu->Instance = GFXMMU;
  hgfxmmu->Init.BlocksPerLine                     = GFXMMU_192BLOCKS;
  hgfxmmu->Init.DefaultValue                      = 0xFFFFFFFFU;
  hgfxmmu->Init.Buffers.Buf0Address               = (uint32_t)PhysFrameBuffer;
  hgfxmmu->Init.Buffers.Buf1Address               = 0;
  hgfxmmu->Init.Buffers.Buf2Address               = 0;
  hgfxmmu->Init.Buffers.Buf3Address               = 0;
#if defined (GFXMMU_CR_CE)
  hgfxmmu->Init.CachePrefetch.Activation          = DISABLE;
  hgfxmmu->Init.CachePrefetch.CacheLock           = GFXMMU_CACHE_LOCK_DISABLE;
  hgfxmmu->Init.CachePrefetch.CacheLockBuffer     = GFXMMU_CACHE_LOCK_BUFFER0; /* NU */
  hgfxmmu->Init.CachePrefetch.CacheForce          = GFXMMU_CACHE_FORCE_ENABLE; /* NU */
  hgfxmmu->Init.CachePrefetch.OutterBufferability = GFXMMU_OUTTER_BUFFERABILITY_DISABLE;
  hgfxmmu->Init.CachePrefetch.OutterCachability   = GFXMMU_OUTTER_CACHABILITY_DISABLE;
  hgfxmmu->Init.CachePrefetch.Prefetch            = GFXMMU_PREFETCH_DISABLE;
#endif /* GFXMMU_CR_CE */
#if defined(GFXMMU_CR_ACE)
  hgfxmmu->Init.AddressCache.Activation             = DISABLE;
  hgfxmmu->Init.AddressCache.AddressCacheLockBuffer = GFXMMU_ADDRESSCACHE_LOCK_BUFFER0;
#endif /* GFXMMU_CR_ACE */
  hgfxmmu->Init.Interrupts.Activation             = DISABLE;
  hgfxmmu->Init.Interrupts.UsedInterrupts         = GFXMMU_AHB_MASTER_ERROR_IT; /* NU */
  return HAL_GFXMMU_Init(hgfxmmu);
}

/**
  * @brief  MX LTDC clock configuration.
  * @param  hltdc LTDC handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_LTDC_ClockConfig(LTDC_HandleTypeDef *hltdc)
{
  RCC_PeriphCLKInitTypeDef  PLL3InitPeriph = {0};

