STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);

  /* Start and configurre PLL3 */
  /* HSE = 16MHZ */
  /* 16/(M=4)   = 4MHz input (min) */
  /* 4*(N=125)  = 500MHz VCO (almost max) */
  /* 500/(P=8)  = 62.5 for DSI ie exactly the lane byte clock*/
  /* 500/(R=24) = 20.83 for LTDC exact match with DSI bandwidth */
  PLL3InitPeriph.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  PLL3InitPeriph.LtdcClockSelection = RCC_LTDCCLKSOURCE_PLL3;
  PLL3InitPeriph.PLL3.PLL3M = 4;
  PLL3InitPeriph.PLL3.PLL3N = 125;
  PLL3InitPeriph.PLL3.PLL3P = 8;
  PLL3InitPeriph.PLL3.PLL3Q = 8;
  PLL3InitPeriph.PLL3.PLL3R = 24;
  PLL3InitPeriph.PLL3.PLL3FRACN = 0;
  PLL3InitPeriph.PLL3.PLL3RGE =  RCC_PLLVCIRANGE_1;
  PLL3InitPeriph.PLL3.PLL3ClockOut = RCC_PLL3_DIVR | RCC_PLL3_DIVP;
  PLL3InitPeriph.PLL3.PLL3Source = RCC_PLLSOURCE_HSE;
  return HAL_RCCEx_PeriphCLKConfig(&PLL3InitPeriph);
}

/**
  * @brief  MX LTDC initialization.
  * @param  hltdc LTDC handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_LTDC_Init(LTDC_HandleTypeDef *hltdc)
{
  /* LTDC initialization */
  hltdc->Instance = LTDC;
  hltdc->Init.HSPolarity         = LTDC_HSPOLARITY_AL;
  hltdc->Init.VSPolarity         = LTDC_VSPOLARITY_AL;
  hltdc->Init.DEPolarity         = LTDC_DEPOLARITY_AL;
  hltdc->Init.PCPolarity         = LTDC_PCPOLARITY_IPC;
  hltdc->Init.HorizontalSync     = HSYNC - 1;
  hltdc->Init.AccumulatedHBP     = HSYNC + HBP - 1;
  hltdc->Init.AccumulatedActiveW = HACT + HBP + HSYNC - 1;
  hltdc->Init.TotalWidth         = HACT + HBP + HFP + HSYNC - 1;
  hltdc->Init.Backcolor.Red      = 0;   /* Not used default value */
  hltdc->Init.Backcolor.Green    = 0;   /* Not used default value */
  hltdc->Init.Backcolor.Blue     = 0;   /* Not used default value */
  hltdc->Init.Backcolor.Reserved = 0xFF;

  if (HAL_LTDCEx_StructInitFromVideoConfig(&hlcd_ltdc, &VidCfg) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_LTDC_Init(hltdc);
}

/**
  * @brief  MX LTDC layer configuration.
  * @param  hltdc LTDC handle.
  * @param  LayerIndex LTDC layer index.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_LTDC_ConfigLayer(LTDC_HandleTypeDef *hltdc, uint32_t LayerIndex)
{
  LTDC_LayerCfgTypeDef LayerCfg = {0};

  /* LTDC layer configuration */
  LayerCfg.WindowX0        = 0;
  LayerCfg.WindowX1        = LCD_WIDTH;
  LayerCfg.WindowY0        = 1;
  LayerCfg.WindowY1        = LCD_HEIGHT;
  LayerCfg.PixelFormat     = LTDC_PIXEL_FORMAT_ARGB8888;
  LayerCfg.Alpha           = 0xFF; /* NU default value */
  LayerCfg.Alpha0          = 0; /* NU default value */
  LayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA; /* Not Used: default value */
  LayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA; /* Not Used: default value */
  LayerCfg.FBStartAdress   = GFXMMU_VIRTUAL_BUFFER0_BASE;
  LayerCfg.ImageWidth      = PIXEL_PER_LINE; /* Number of pixels per line in virtual frame buffer */
  LayerCfg.ImageHeight     = 480;
  LayerCfg.Backcolor.Red   = 0; /* Not Used: default value */
  LayerCfg.Backcolor.Green = 0; /* Not Used: default value */
  LayerCfg.Backcolor.Blue  = 0; /* Not Used: default value */
  LayerCfg.Backcolor.Reserved = 0xFF;
  return HAL_LTDC_ConfigLayer(hltdc, &LayerCfg, LayerIndex);
}

/**
  * @brief  MX DSI initialization.
  * @param  hdsi DSI handle.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_DSI_Init(DSI_HandleTypeDef *hdsi)
{
  DSI_PLLInitTypeDef      PLLInit = {0};

  /* DSI initialization */
  hdsi->Instance = DSI;
  hdsi->Init.AutomaticClockLaneControl = DSI_AUTO_CLK_LANE_CTRL_DISABLE;
  /* We have 1 data lane at 500Mbps => lane byte clock at 500/8 = 62,5 MHZ */
  /* We want TX escape clock at around 20MHz and under 20MHz so clock division is set to 4 */
  hdsi->Init.TXEscapeCkdiv     = 4;
  hdsi->Init.NumberOfLanes     = DSI_TWO_DATA_LANES;
  hdsi->Init.PHYFrequencyRange = DSI_DPHY_FRANGE_450MHZ_510MHZ;
  hdsi->Init.PHYLowPowerOffset = 0;

  PLLInit.PLLNDIV          = 125;
  PLLInit.PLLIDF           = 4;
  PLLInit.PLLODF           = 2;
  PLLInit.PLLVCORange      = DSI_DPHY_VCO_FRANGE_800MHZ_1GHZ;
  PLLInit.PLLChargePump    = DSI_PLL_CHARGE_PUMP_2000HZ_4400HZ;
  PLLInit.PLLTuning        = DSI_PLL_LOOP_FILTER_2000HZ_4400HZ;

  if (HAL_DSI_Init(hdsi, &PLLInit) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (HAL_DSI_SetGenericVCID(&hlcd_dsi, 0) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Configure the DSI for Video mode */
  VidCfg.VirtualChannelID             = 0;
  VidCfg.HSPolarity                   = DSI_HSYNC_ACTIVE_HIGH;
  VidCfg.VSPolarity                   = DSI_VSYNC_ACTIVE_HIGH;
  VidCfg.DEPolarity                   = DSI_DATA_ENABLE_ACTIVE_HIGH;
  VidCfg.ColorCoding                  = DSI_RGB888;
  VidCfg.Mode                         = DSI_VID_MODE_BURST;
  VidCfg.PacketSize                   = LCD_WIDTH;
  VidCfg.NullPacketSize               = 0xFFFU;
  VidCfg.HorizontalSyncActive         = HSYNC * 3;
  VidCfg.HorizontalBackPorch          = HBP * 3;
  VidCfg.HorizontalLine               = (HACT + HSYNC + HBP + HFP) * 3;
  VidCfg.VerticalSyncActive           = VSYNC;
  VidCfg.VerticalBackPorch            = VBP;
  VidCfg.VerticalFrontPorch           = VFP;
  VidCfg.VerticalActive               = VACT;
  VidCfg.LPCommandEnable              = DSI_LP_COMMAND_ENABLE;
  VidCfg.LPLargestPacketSize          = 64;
  /* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
  /* while streaming is active in video mode                                                                         */
  VidCfg.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;
  VidCfg.LPHorizontalBackPorchEnable  = DSI_LP_HBP_ENABLE;
  VidCfg.LPVerticalActiveEnable       = DSI_LP_VACT_ENABLE;
  VidCfg.LPVerticalFrontPorchEnable   = DSI_LP_VFP_ENABLE;
  VidCfg.LPVerticalBackPorchEnable    = DSI_LP_VBP_ENABLE;
  VidCfg.LPVerticalSyncActiveEnable   = DSI_LP_VSYNC_ENABLE;
  VidCfg.FrameBTAAcknowledgeEnable    = DSI_FBTAA_ENABLE;
  VidCfg.LooselyPacked                = DSI_LOOSELY_PACKED_DISABLE;

  /* Drive the display */
  if (HAL_DSI_ConfigVideoMode(&hlcd_dsi, &VidCfg) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  MX DMA2D initialization.
  * @param  hdma2d  DMA2D handle.
  * @param  Mode    DMA2D transfer mode.
  * @param  OffLine DMA2D output offset.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_DMA2D_Init(DMA2D_HandleTypeDef *hdma2d, uint32_t Mode, uint32_t OffLine)
{
  /* Register to memory mode with ARGB8888 as color Mode */
  hdma2d->Instance            = DMA2D;
  hdma2d->Init.Mode           = Mode;
  hdma2d->Init.ColorMode      = DMA2D_OUTPUT_ARGB8888;
  hdma2d->Init.OutputOffset   = OffLine;
  hdma2d->Init.AlphaInverted  = DMA2D_REGULAR_ALPHA;
  hdma2d->Init.RedBlueSwap    = DMA2D_RB_REGULAR;
  hdma2d->Init.BytesSwap      = DMA2D_BYTES_REGULAR;
  hdma2d->Init.LineOffsetMode = DMA2D_LOM_PIXELS;

