STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
  /* DMA2D Initialization */
  return HAL_DMA2D_Init(hdma2d);
}

#if (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register Default LCD GFXMMU Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_LCD_GFXMMU_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_GFXMMU_RESET_HANDLE_STATE(&hlcd_gfxmmu);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_GFXMMU_RegisterCallback(&hlcd_gfxmmu, HAL_GFXMMU_MSPINIT_CB_ID, GFXMMU_MspInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_GFXMMU_RegisterCallback(&hlcd_gfxmmu, HAL_GFXMMU_MSPDEINIT_CB_ID, GFXMMU_MspDeInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdGfxmmu_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}

/**
  * @brief Register LCD GFXMMU Msp Callback
  * @param Callbacks pointer to LCD MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_LCD_GFXMMU_RegisterMspCallbacks(uint32_t Instance, BSP_LCD_GFXMMU_Cb_t *Callback)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_GFXMMU_RESET_HANDLE_STATE(&hlcd_gfxmmu);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_GFXMMU_RegisterCallback(&hlcd_gfxmmu, HAL_GFXMMU_MSPINIT_CB_ID, Callback->pMspGfxmmuInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_GFXMMU_RegisterCallback(&hlcd_gfxmmu, HAL_GFXMMU_MSPDEINIT_CB_ID, \
                                         Callback->pMspGfxmmuDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdGfxmmu_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}
#endif /* USE_HAL_GFXMMU_REGISTER_CALLBACKS */

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register Default LCD LTDC Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_LCD_LTDC_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_LTDC_RESET_HANDLE_STATE(&hlcd_ltdc);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_LTDC_RegisterCallback(&hlcd_ltdc, HAL_LTDC_MSPINIT_CB_ID, LTDC_MspInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_LTDC_RegisterCallback(&hlcd_ltdc, HAL_LTDC_MSPDEINIT_CB_ID, LTDC_MspDeInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdLtdc_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}

/**
  * @brief Register LCD LTDC Msp Callback
  * @param Callbacks pointer to LCD MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_LCD_LTDC_RegisterMspCallbacks(uint32_t Instance, BSP_LCD_LTDC_Cb_t *Callback)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_LTDC_RESET_HANDLE_STATE(&hlcd_ltdc);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_LTDC_RegisterCallback(&hlcd_ltdc, HAL_LTDC_MSPINIT_CB_ID, Callback->pMspLtdcInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_LTDC_RegisterCallback(&hlcd_ltdc, HAL_LTDC_MSPDEINIT_CB_ID, Callback->pMspLtdcDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdLtdc_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register Default LCD DSI Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_LCD_DSI_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DSI_RESET_HANDLE_STATE(&hlcd_dsi);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_DSI_RegisterCallback(&hlcd_dsi, HAL_DSI_MSPINIT_CB_ID, DSI_MspInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_DSI_RegisterCallback(&hlcd_dsi, HAL_DSI_MSPDEINIT_CB_ID, DSI_MspDeInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdDsi_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}

/**
  * @brief Register LCD DSI Msp Callback
  * @param Callbacks pointer to LCD MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_LCD_DSI_RegisterMspCallbacks(uint32_t Instance, BSP_LCD_DSI_Cb_t *Callback)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DSI_RESET_HANDLE_STATE(&hlcd_dsi);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_DSI_RegisterCallback(&hlcd_dsi, HAL_DSI_MSPINIT_CB_ID, Callback->pMspDsiInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_DSI_RegisterCallback(&hlcd_dsi, HAL_DSI_MSPDEINIT_CB_ID, Callback->pMspDsiDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdDsi_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register Default LCD DMA2D Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_LCD_DMA2D_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DMA2D_RESET_HANDLE_STATE(&hlcd_dma2d);

    /* Register default MspInit/MspDeInit Callback */
    if (HAL_DMA2D_RegisterCallback(&hlcd_dma2d, HAL_DMA2D_MSPINIT_CB_ID, DMA2D_MspInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_DMA2D_RegisterCallback(&hlcd_dma2d, HAL_DMA2D_MSPDEINIT_CB_ID, DMA2D_MspDeInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdDma2d_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}

/**
  * @brief Register LCD DMA2D Msp Callback
  * @param Callbacks pointer to LCD MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_LCD_DMA2D_RegisterMspCallbacks(uint32_t Instance, BSP_LCD_DMA2D_Cb_t *Callback)
{
  int32_t status = BSP_ERROR_NONE;

  if (Instance >= LCD_INSTANCES_NBR)
  {
    status = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DMA2D_RESET_HANDLE_STATE(&hlcd_dma2d);

    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_DMA2D_RegisterCallback(&hlcd_dma2d, HAL_DMA2D_MSPINIT_CB_ID, Callback->pMspDma2dInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_DMA2D_RegisterCallback(&hlcd_dma2d, HAL_DMA2D_MSPDEINIT_CB_ID, Callback->pMspDma2dDeInitCb) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      LcdDma2d_IsMspCbValid[Instance] = 1U;
    }
  }

  /* BSP status */
  return status;
}
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup STM32U5x9J_DISCOVERY_LCD_Private_Functions LCD Private Functions
  * @{
  */


/**
  * @brief  Initialize LCD.
  * @param  Orientation LCD_ORIENTATION_PORTRAIT, LCD_ORIENTATION_LANDSCAPE,
  *                     LCD_ORIENTATION_PORTRAIT_ROT180 or LCD_ORIENTATION_LANDSCAPE_ROT180.
  * @retval BSP status.
  */
static int32_t LCD_Init(uint32_t Orientation)
{
  int32_t status = BSP_ERROR_NONE;
  uint32_t ErrorNumber = 0;
  DSI_PHY_TimerTypeDef     PhyTimers = {0};
  DSI_HOST_TimeoutTypeDef  HostTimeouts = {0};

  /***************/
  /* GFXMMU init */
  /***************/
#if (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0)
  GFXMMU_MspInit(&hlcd_gfxmmu);
#else
  /* Register the GFXMMU MSP Callbacks */
  if (LcdGfxmmu_IsMspCbValid[0] == 0U)
  {
    if (BSP_LCD_GFXMMU_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }
#endif /* (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0) */

  if (status == BSP_ERROR_NONE)
  {
    /* GFXMMU peripheral initialization */
    if (MX_GFXMMU_Init(&hlcd_gfxmmu) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    /* Initialize LUT */
    else if (HAL_GFXMMU_ConfigLut(&hlcd_gfxmmu, 0, LCD_WIDTH, (uint32_t)&gfxmmu_lut_config_argb8888) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Disable non visible lines : from line 480 to 1023 */
      if (HAL_OK != HAL_GFXMMU_DisableLutLines(&hlcd_gfxmmu, LCD_WIDTH, 544))
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }

