STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
  /************/
  /* DSI init */
  /************/
  if (status == BSP_ERROR_NONE)
  {
#if (USE_HAL_DSI_REGISTER_CALLBACKS == 0)
    DSI_MspInit(&hlcd_dsi);
#else
    /* Register the DSI MSP Callbacks */
    if (LcdDsi_IsMspCbValid[0] == 0U)
    {
      if (BSP_LCD_DSI_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }
#endif /* (USE_HAL_DSI_REGISTER_CALLBACKS == 0) */

    if (status == BSP_ERROR_NONE)
    {
      /* DSI peripheral initialization */
      if (MX_DSI_Init(&hlcd_dsi) != HAL_OK)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }

  /*********************/
  /* LCD configuration */
  /*********************/
  if (status == BSP_ERROR_NONE)
  {

    PhyTimers.ClockLaneHS2LPTime  = 11;
    PhyTimers.ClockLaneLP2HSTime  = 40;
    PhyTimers.DataLaneHS2LPTime   = 12;
    PhyTimers.DataLaneLP2HSTime   = 23;
    PhyTimers.DataLaneMaxReadTime = 0;
    PhyTimers.StopWaitTime        = 7;

    if (HAL_DSI_ConfigPhyTimer(&hlcd_dsi, &PhyTimers) != HAL_OK)
    {
      return 6;
    }

    HostTimeouts.TimeoutCkdiv                 = 1;
    HostTimeouts.HighSpeedTransmissionTimeout = 0;
    HostTimeouts.LowPowerReceptionTimeout     = 0;
    HostTimeouts.HighSpeedReadTimeout         = 0;
    HostTimeouts.LowPowerReadTimeout          = 0;
    HostTimeouts.HighSpeedWriteTimeout        = 0;
    HostTimeouts.HighSpeedWritePrespMode      = 0;
    HostTimeouts.LowPowerWriteTimeout         = 0;
    HostTimeouts.BTATimeout                   = 0;

    if (HAL_DSI_ConfigHostTimeouts(&hlcd_dsi, &HostTimeouts) != HAL_OK)
    {
      return 7;
    }

    if (HAL_DSI_ConfigFlowControl(&hlcd_dsi, DSI_FLOW_CONTROL_BTA) != HAL_OK)
    {
      return 7;
    }

    /* Enable the DSI host */
    __HAL_DSI_ENABLE(&hlcd_dsi);

    /*************/
    /* LTDC init */
    /*************/
    if (status == BSP_ERROR_NONE)
    {
      if (MX_LTDC_ClockConfig(&hlcd_ltdc) != HAL_OK)
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 0)
        LTDC_MspInit(&hlcd_ltdc);
#else
        /* Register the LTDC MSP Callbacks */
        if (LcdLtdc_IsMspCbValid[0] == 0U)
        {
          if (BSP_LCD_LTDC_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
        }
#endif /* (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0) */

        if (status == BSP_ERROR_NONE)
        {
          /* LTDC peripheral initialization */
          if (MX_LTDC_Init(&hlcd_ltdc) != HAL_OK)
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            if (MX_LTDC_ConfigLayer(&hlcd_ltdc, LTDC_LAYER_1) != HAL_OK)
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
          }
        }
      }
    }

    /* Start DSI */
    if (HAL_DSI_Start(&(hlcd_dsi)) != HAL_OK)
    {
      return 8;
    }


    /* CMD Mode */
    uint8_t InitParam1[3] = {0xFF, 0x83, 0x79};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 3, 0xB9, InitParam1) != HAL_OK) { ErrorNumber++; }

    /* SETPOWER */
    uint8_t InitParam2[16] = {0x44, 0x1C, 0x1C, 0x37, 0x57, 0x90, 0xD0, 0xE2, 0x58, 0x80, 0x38, 0x38, 0xF8, 0x33, 0x34, 0x42};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 16, 0xB1, InitParam2) != HAL_OK) { ErrorNumber++; }

    /* SETDISP */
    uint8_t InitParam3[9] = {0x80, 0x14, 0x0C, 0x30, 0x20, 0x50, 0x11, 0x42, 0x1D};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 9, 0xB2, InitParam3) != HAL_OK) { ErrorNumber++; }

    /* Set display cycle timing */
    uint8_t InitParam4[10] = {0x01, 0xAA, 0x01, 0xAF, 0x01, 0xAF, 0x10, 0xEA, 0x1C, 0xEA};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 10, 0xB4, InitParam4) != HAL_OK) { ErrorNumber++; }

    /* SETVCOM */
    uint8_t InitParam5[4] = {00, 00, 00, 0xC0};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 4, 0xC7, InitParam5) != HAL_OK) { ErrorNumber++; }

    /* Set Panel Related Registers */
    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xCC, 0x02) != HAL_OK) { ErrorNumber++; }

    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xD2, 0x77) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam6[37] = {0x00, 0x07, 0x00, 0x00, 0x00, 0x08, 0x08, 0x32, 0x10, 0x01, 0x00, 0x01, 0x03, 0x72, 0x03, 0x72, 0x00, 0x08, 0x00, 0x08, 0x33, 0x33, 0x05, 0x05, 0x37, 0x05, 0x05, 0x37, 0x0A, 0x00, 0x00, 0x00, 0x0A, 0x00, 0x01, 0x00, 0x0E};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 37, 0xD3, InitParam6) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam7[34] = {0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x19, 0x19, 0x18, 0x18, 0x18, 0x18, 0x19, 0x19, 0x01, 0x00, 0x03, 0x02, 0x05, 0x04, 0x07, 0x06, 0x23, 0x22, 0x21, 0x20, 0x18, 0x18, 0x18, 0x18, 0x00, 0x00};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 34, 0xD5, InitParam7) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam8[32] = {0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x19, 0x19, 0x18, 0x18, 0x19, 0x19, 0x18, 0x18, 0x06, 0x07, 0x04, 0x05, 0x02, 0x03, 0x00, 0x01, 0x20, 0x21, 0x22, 0x23, 0x18, 0x18, 0x18, 0x18};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 35, 0xD6, InitParam8) != HAL_OK) { ErrorNumber++; }

    /* SET GAMMA */
    uint8_t InitParam9[42] = {0x00, 0x16, 0x1B, 0x30, 0x36, 0x3F, 0x24, 0x40, 0x09, 0x0D, 0x0F, 0x18, 0x0E, 0x11, 0x12, 0x11, 0x14, 0x07, 0x12, 0x13, 0x18, 0x00, 0x17, 0x1C, 0x30, 0x36, 0x3F, 0x24, 0x40, 0x09, 0x0C, 0x0F, 0x18, 0x0E, 0x11, 0x14, 0x11, 0x12, 0x07, 0x12, 0x14, 0x18};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 42, 0xE0, InitParam9) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam10[3] = {0x2C, 0x2C, 00};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 3, 0xB6, InitParam10) != HAL_OK) { ErrorNumber++; }

    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xBD, 0x00) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam11[] = {0x01, 0x00, 0x07, 0x0F, 0x16, 0x1F, 0x27, 0x30, 0x38, 0x40, 0x47, 0x4E, 0x56, 0x5D, 0x65, 0x6D, 0x74, 0x7D, 0x84, 0x8A, 0x90, 0x99, 0xA1, 0xA9, 0xB0, 0xB6, 0xBD, 0xC4, 0xCD, 0xD4, 0xDD, 0xE5, 0xEC, 0xF3, 0x36, 0x07, 0x1C, 0xC0, 0x1B, 0x01, 0xF1, 0x34, 0x00};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 42, 0xC1, InitParam11) != HAL_OK) { ErrorNumber++; }

    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xBD, 0x01) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam12[] = {0x00, 0x08, 0x0F, 0x16, 0x1F, 0x28, 0x31, 0x39, 0x41, 0x48, 0x51, 0x59, 0x60, 0x68, 0x70, 0x78, 0x7F, 0x87, 0x8D, 0x94, 0x9C, 0xA3, 0xAB, 0xB3, 0xB9, 0xC1, 0xC8, 0xD0, 0xD8, 0xE0, 0xE8, 0xEE, 0xF5, 0x3B, 0x1A, 0xB6, 0xA0, 0x07, 0x45, 0xC5, 0x37, 0x00};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 42, 0xC1, InitParam12) != HAL_OK) { ErrorNumber++; }

