STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xBD, 0x02) != HAL_OK) { ErrorNumber++; }

    uint8_t InitParam13[42] = {0x00, 0x09, 0x0F, 0x18, 0x21, 0x2A, 0x34, 0x3C, 0x45, 0x4C, 0x56, 0x5E, 0x66, 0x6E, 0x76, 0x7E, 0x87, 0x8E, 0x95, 0x9D, 0xA6, 0xAF, 0xB7, 0xBD, 0xC5, 0xCE, 0xD5, 0xDF, 0xE7, 0xEE, 0xF4, 0xFA, 0xFF, 0x0C, 0x31, 0x83, 0x3C, 0x5B, 0x56, 0x1E, 0x5A, 0xFF};
    if (HAL_DSI_LongWrite(&hlcd_dsi, 0, DSI_DCS_LONG_PKT_WRITE, 42, 0xC1, InitParam13) != HAL_OK) { ErrorNumber++; }

    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, 0xBD, 0x00) != HAL_OK) { ErrorNumber++; }

    /* Exit Sleep Mode*/
    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P0, 0x11, 0x00) != HAL_OK) { ErrorNumber++; }

    HAL_Delay(120);

    /* Display On */
    if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P0, 0x29, 0x00) != HAL_OK) { ErrorNumber++; }

    HAL_Delay(120);

    if (ErrorNumber != 0U)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return status;
}

/**
  * @brief  De-Initialize LCD.
  * @retval BSP status.
  */
static int32_t LCD_DeInit(void)
{
  int32_t  status = BSP_ERROR_NONE;
  uint32_t ErrorNumber = 0;

  /* Disable DSI wrapper */
  __HAL_DSI_WRAPPER_DISABLE(&hlcd_dsi);

  /* Set display off */
  if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P1, DSI_SET_DISPLAY_OFF, 0x00) != HAL_OK)
  {
    ErrorNumber++;
  }

  /* Wait before entering in sleep mode */
  HAL_Delay(2000);

  /* Put LCD in sleep mode */
  if (HAL_DSI_ShortWrite(&hlcd_dsi, 0, DSI_DCS_SHORT_PKT_WRITE_P0, DSI_ENTER_SLEEP_MODE, 0x0) != HAL_OK)
  {
    ErrorNumber++;
  }

  HAL_Delay(120);

  /* De-initialize DSI */
  if (HAL_DSI_DeInit(&hlcd_dsi) != HAL_OK)
  {
    ErrorNumber++;
  }
#if (USE_HAL_DSI_REGISTER_CALLBACKS == 0)
  DSI_MspDeInit(&hlcd_dsi);
#endif /* (USE_HAL_DSI_REGISTER_CALLBACKS == 0) */

  /* De-initialize LTDC */
  if (HAL_LTDC_DeInit(&hlcd_ltdc) != HAL_OK)
  {
    ErrorNumber++;
  }
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 0)
  LTDC_MspDeInit(&hlcd_ltdc);
#endif /* (USE_HAL_LTDC_REGISTER_CALLBACKS == 0) */

  /* De-initialize GFXMMU */
  if (HAL_GFXMMU_DeInit(&hlcd_gfxmmu) != HAL_OK)
  {
    ErrorNumber++;
  }
#if (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0)
  GFXMMU_MspDeInit(&hlcd_gfxmmu);
#endif /* (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0) */

  if (ErrorNumber != 0U)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }

  return status;
}

/**
  * @brief  Converts a line to an ARGB8888 pixel format.
  * @param  pSrc: Pointer to source buffer
  * @param  pDst: Output color
  * @param  xSize: Buffer width
  * @param  ColorMode: Input color mode
  */
static int32_t LCD_ConvertLineToARGB8888(uint32_t *pSrc, uint32_t *pDst, uint32_t xSize, uint32_t ColorMode)
{
  int32_t  status = BSP_ERROR_NONE;

#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 0)
  DMA2D_MspInit(&hlcd_dma2d);
#else
  /* Register the DMA2D MSP Callbacks */
  if (LcdDma2d_IsMspCbValid[0] == 0U)
  {
    if (BSP_LCD_DMA2D_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
  }
#endif /* (USE_HAL_GFXMMU_REGISTER_CALLBACKS == 0) */

  if (status == BSP_ERROR_NONE)
  {
    /* DMA2D peripheral initialization */
    if (MX_DMA2D_Init(&hlcd_dma2d, DMA2D_M2M_PFC, 0) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      hlcd_dma2d.LayerCfg[1].AlphaMode      = DMA2D_NO_MODIF_ALPHA;
      hlcd_dma2d.LayerCfg[1].InputAlpha     = 0xFF;
      hlcd_dma2d.LayerCfg[1].InputColorMode = ColorMode;
      hlcd_dma2d.LayerCfg[1].InputOffset    = 0;
      hlcd_dma2d.LayerCfg[1].AlphaInverted  = DMA2D_REGULAR_ALPHA;
      hlcd_dma2d.LayerCfg[1].RedBlueSwap    = DMA2D_RB_REGULAR;
      if (HAL_DMA2D_ConfigLayer(&hlcd_dma2d, 1) == HAL_OK)
      {
        if (HAL_DMA2D_Start(&hlcd_dma2d, (uint32_t)pSrc, (uint32_t)pDst, xSize, 1) == HAL_OK)
        {
          /* Polling For DMA transfer */
          if (HAL_DMA2D_PollForTransfer(&hlcd_dma2d, 10) == HAL_OK)
          {
            if (HAL_DMA2D_DeInit(&hlcd_dma2d) == HAL_OK)
            {
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 0)
              DMA2D_MspDeInit(&hlcd_dma2d);
#endif /* (USE_HAL_DMA2D_REGISTER_CALLBACKS == 0) */
            }
            else
            {
              status = BSP_ERROR_PERIPH_FAILURE;
            }
          }
          else
          {
            status = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        else
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
      }
      else
      {
        status = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }

  return status;
}

/**
  * @brief  Initialize GFXMMU MSP.
  * @param  hgfxmmu GFXMMU handle
  * @retval None
  */
static void GFXMMU_MspInit(GFXMMU_HandleTypeDef *hgfxmmu)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxmmu);

  /* GFXMMU clock enable */
  __HAL_RCC_GFXMMU_CLK_ENABLE();

  /* Enable GFXMMU interrupt */
  HAL_NVIC_SetPriority(GFXMMU_IRQn, BSP_LCD_GFXMMU_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(GFXMMU_IRQn);
}

/**
  * @brief  De-Initialize GFXMMU MSP.
  * @param  hgfxmmu GFXMMU handle
  * @retval None
  */
static void GFXMMU_MspDeInit(GFXMMU_HandleTypeDef *hgfxmmu)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxmmu);

  /* Disable GFXMMU interrupt */
  HAL_NVIC_DisableIRQ(GFXMMU_IRQn);

  /* GFXMMU clock disable */
  __HAL_RCC_GFXMMU_CLK_DISABLE();
}

/**
  * @brief  Initialize LTDC MSP.
  * @param  hltdc LTDC handle
  * @retval None
  */
static void LTDC_MspInit(LTDC_HandleTypeDef *hltdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);

  /* Enable LCD clock */
  __HAL_RCC_LTDC_CLK_ENABLE();

  /* Enable LTDC interrupt */
  HAL_NVIC_SetPriority(LTDC_IRQn, BSP_LCD_LTDC_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(LTDC_IRQn);

  HAL_NVIC_SetPriority(LTDC_ER_IRQn, BSP_LCD_LTDC_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(LTDC_ER_IRQn);
}

/**
  * @brief  De-Initialize LTDC MSP.
  * @param  hltdc LTDC handle
  * @retval None
  */
static void LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);

