STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5x9J-DK/stm32u5x9j_discovery_lcd.c
  /* Disable LTDC interrupts */
  HAL_NVIC_DisableIRQ(LTDC_ER_IRQn);
  HAL_NVIC_DisableIRQ(LTDC_IRQn);

  /* LTDC clock disable */
  __HAL_RCC_LTDC_CLK_DISABLE();
}

/**
  * @brief  Initialize DSI MSP.
  * @param  hdsi DSI handle
  * @retval None
  */
static void DSI_MspInit(DSI_HandleTypeDef *hdsi)
{
  RCC_PeriphCLKInitTypeDef  PLL3InitPeriph = {0};
  RCC_PeriphCLKInitTypeDef  DSIPHYInitPeriph = {0};
  GPIO_InitTypeDef          GPIO_InitStruct  = {0};

  UNUSED(hdsi);

  /* Enable GPIOI & GPIOD clocks */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOI_CLK_ENABLE();

  /* Configure DSI Reset pin */
  GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull  = GPIO_PULLDOWN;
  GPIO_InitStruct.Pin   = GPIO_PIN_5;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* Configure LCD Backlight Pin */
  GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull  = GPIO_PULLUP;
  GPIO_InitStruct.Pin   = GPIO_PIN_6;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  /* Enable DSI clock */
  __HAL_RCC_DSI_CLK_ENABLE();

  /** ################ Set DSI clock to D-PHY source clock ################## **/

  /* Start and configurre PLL3 */
  /* HSE = 16MHZ */
  /* 16/(M=4)   = 4MHz input (min) */
  /* 4*(N=125)  = 500MHz VCO (almost max) */
  /* 500/(P=8)  = 62.5 for DSI ie exactly the lane byte clock*/

  PLL3InitPeriph.PeriphClockSelection = RCC_PERIPHCLK_DSI;
  PLL3InitPeriph.DsiClockSelection = RCC_DSICLKSOURCE_PLL3;
  PLL3InitPeriph.PLL3.PLL3M = 4;
  PLL3InitPeriph.PLL3.PLL3N = 125;
  PLL3InitPeriph.PLL3.PLL3P = 8;
  PLL3InitPeriph.PLL3.PLL3Q = 8;
  PLL3InitPeriph.PLL3.PLL3R = 24;
  PLL3InitPeriph.PLL3.PLL3FRACN = 0;
  PLL3InitPeriph.PLL3.PLL3RGE =  RCC_PLLVCIRANGE_1;
  PLL3InitPeriph.PLL3.PLL3ClockOut = RCC_PLL3_DIVR | RCC_PLL3_DIVP;
  PLL3InitPeriph.PLL3.PLL3Source = RCC_PLLSOURCE_HSE;
  (void)HAL_RCCEx_PeriphCLKConfig(&PLL3InitPeriph);

  __HAL_RCC_DSI_CLK_ENABLE();

  /* Switch to D-PHY source clock */
  /* Enable the DSI host */
  hlcd_dsi.Instance = DSI;

  __HAL_DSI_ENABLE(&hlcd_dsi);

  /* Enable the DSI PLL */
  __HAL_DSI_PLL_ENABLE(&hlcd_dsi);

  HAL_Delay(1);

  /* Enable the clock lane and the digital section of the D-PHY   */
  hlcd_dsi.Instance->PCTLR |= (DSI_PCTLR_CKE | DSI_PCTLR_DEN);

  /* Set the TX escape clock division factor */
  hlcd_dsi.Instance->CCR = 4;

  /* Config DSI Clock to DSI PHY */
  DSIPHYInitPeriph.PeriphClockSelection = RCC_PERIPHCLK_DSI;
  DSIPHYInitPeriph.DsiClockSelection    = RCC_DSICLKSOURCE_DSIPHY;

  (void)HAL_RCCEx_PeriphCLKConfig(&DSIPHYInitPeriph);

  /* Reset  */
  HAL_Delay(11);
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_SET);
  HAL_Delay(150);

  /* Reset the TX escape clock division factor */
  hlcd_dsi.Instance->CCR &= ~DSI_CCR_TXECKDIV;

  /* Disable the DSI PLL */
  __HAL_DSI_PLL_DISABLE(&hlcd_dsi);

  /* Disable the DSI host */
  __HAL_DSI_DISABLE(&hlcd_dsi);

  /** ######################################################################### **/


  /* Enable DSI NVIC interrupt */
  /* Default is lowest priority level */
  HAL_NVIC_SetPriority(DSI_IRQn, 0x0FUL, 0);
  HAL_NVIC_EnableIRQ(DSI_IRQn);
}

/**
  * @brief  De-Initialize DSI MSP.
  * @param  hdsi DSI handle
  * @retval None
  */
static void DSI_MspDeInit(DSI_HandleTypeDef *hdsi)
{
  RCC_PeriphCLKInitTypeDef  PLL3InitPeriph = {0};

  UNUSED(hdsi);

  /* Switch to PLL3 before Disable */
  PLL3InitPeriph.PeriphClockSelection = RCC_PERIPHCLK_DSI;
  PLL3InitPeriph.DsiClockSelection = RCC_DSICLKSOURCE_PLL3;
  PLL3InitPeriph.PLL3.PLL3M = 4;
  PLL3InitPeriph.PLL3.PLL3N = 125;
  PLL3InitPeriph.PLL3.PLL3P = 8;
  PLL3InitPeriph.PLL3.PLL3Q = 8;
  PLL3InitPeriph.PLL3.PLL3R = 24;
  PLL3InitPeriph.PLL3.PLL3FRACN = 0;
  PLL3InitPeriph.PLL3.PLL3RGE =  RCC_PLLVCIRANGE_1;
  PLL3InitPeriph.PLL3.PLL3ClockOut = RCC_PLL3_DIVR | RCC_PLL3_DIVP;
  PLL3InitPeriph.PLL3.PLL3Source = RCC_PLLSOURCE_HSE;
  (void)HAL_RCCEx_PeriphCLKConfig(&PLL3InitPeriph);

  /* DSI clock disable */
  __HAL_RCC_DSI_CLK_DISABLE();

  /** @brief Toggle Sw reset of DSI IP */
  __HAL_RCC_DSI_FORCE_RESET();
  __HAL_RCC_DSI_RELEASE_RESET();

  /* Disable DSI interrupts */
  HAL_NVIC_DisableIRQ(DSI_IRQn);

}

/**
  * @brief  Initialize DMA2D MSP.
  * @param  hdma2d DMA2D handle
  * @retval None
  */
static void DMA2D_MspInit(DMA2D_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);

  /* DMA2D clock enable */
  __HAL_RCC_DMA2D_CLK_ENABLE();

  /* Enable DMA2D interrupt */
  HAL_NVIC_SetPriority(DMA2D_IRQn, BSP_LCD_DMA2D_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(DMA2D_IRQn);
}

/**
  * @brief  De-Initialize DMA2D MSP.
  * @param  hdma2d DMA2D handle
  * @retval None
  */
static void DMA2D_MspDeInit(DMA2D_HandleTypeDef *hdma2d)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdma2d);

  /* Disable DMA2D interrupt */
  HAL_NVIC_DisableIRQ(DMA2D_IRQn);

  /* DMA2D clock disable */
  __HAL_RCC_DMA2D_CLK_DISABLE();
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

